{
    "recordsets"
:
    [{
        "datasetName": "Village_Code@VectorData",
        "features": [{
            "fieldNames": ["SmID", "SmUserID", "SmArea", "SmPerimeter", "ID", "mpArea", "mpPerimete", "vd_id", "Town_id", "country_id", "is_proper", "vd_head", "vd_contact", "vd_group_num_1", "Town_name", "County_name", "vd_name", "Vd_Average_Net_income", "vd_ainim_count", "vc_hh_num", "vc_total_people", "vc_poor_num", "vc_poor_people", "vc_five_people", "vc_lowinc_people", "vc_minority_num", "vc_women_num", "vc_disabled_num", "vc_labor_num", "vc_move_hhnum", "vc_nowater_hhnum", "vc_reconstru_hhnum", "vc_college_studnumber", "vc_senior_studnumber", "vd_earth", "vd_irri", "vd_forest", "vd_resore_earth", "Vd_income", "OldID"],
            "ID": 851,
            "fieldValues": ["851", "0", "265113.4205416947", "2534.4773570293387", "3590", "265161.777223", "2535.563738", "522401001002", "522401001", "522401", "0", "", "", "", "市西街道办事处", "", "桂花社区", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "52240100106"],
            "geometry": {
                "id": 851,
                "center": {"y": 27.30213050350244, "x": 105.28216684014237},
                "style": null,
                "parts": [45],
                "points": [{"y": 27.305317406831662, "x": 105.28183582496821}, {
                    "y": 27.305307796537782,
                    "x": 105.28191867690865
                }, {"y": 27.3047328125262, "x": 105.28211242204097}, {
                    "y": 27.30417285430921,
                    "x": 105.2824847667311
                }, {"y": 27.30390566162971, "x": 105.28272898400787}, {
                    "y": 27.30357543807646,
                    "x": 105.28314639005137
                }, {"y": 27.30325017076165, "x": 105.28354317038821}, {
                    "y": 27.303029808148146,
                    "x": 105.28372421488518
                }, {"y": 27.30217609661161, "x": 105.28410176126341}, {
                    "y": 27.30178455202023,
                    "x": 105.2844529630166
                }, {"y": 27.3016453878584, "x": 105.28459293738288}, {
                    "y": 27.30149737864175,
                    "x": 105.28485120634247
                }, {"y": 27.30107400152265, "x": 105.2854205693865}, {
                    "y": 27.301017174383798,
                    "x": 105.28572753080611
                }, {"y": 27.30106808599107, "x": 105.2860159116051}, {
                    "y": 27.301214489358813,
                    "x": 105.28637865840194
                }, {"y": 27.301213611623773, "x": 105.28680691426266}, {
                    "y": 27.301139582395805,
                    "x": 105.28702908809302
                }, {"y": 27.30099186321696, "x": 105.28730872218922}, {
                    "y": 27.30082946204135,
                    "x": 105.28757184637577
                }, {"y": 27.300333720728965, "x": 105.28813153112674}, {
                    "y": 27.29997045767887,
                    "x": 105.28666610872804
                }, {"y": 27.299779434529235, "x": 105.28615370538999}, {
                    "y": 27.299451466599916,
                    "x": 105.28551809614109
                }, {"y": 27.299232666295648, "x": 105.2851694380976}, {
                    "y": 27.298998506162945,
                    "x": 105.28337715984172
                }, {"y": 27.298943600173217, "x": 105.28264087281364}, {
                    "y": 27.299466453356004,
                    "x": 105.28218650369492
                }, {"y": 27.299999847010703, "x": 105.28175432665871}, {
                    "y": 27.301153312410214,
                    "x": 105.28111778152233
                }, {"y": 27.30152175787683, "x": 105.28085859027703}, {
                    "y": 27.301735265930784,
                    "x": 105.28060984626939
                }, {"y": 27.301909892837852, "x": 105.28043687150665}, {
                    "y": 27.302249528766197,
                    "x": 105.28005838246725
                }, {"y": 27.302696210517755, "x": 105.27940919861771}, {
                    "y": 27.302977512403288,
                    "x": 105.2791497801659
                }, {"y": 27.30351503418568, "x": 105.2788674776989}, {
                    "y": 27.30398558474396,
                    "x": 105.27877786938589
                }, {"y": 27.304389905403077, "x": 105.280286342449}, {
                    "y": 27.304682878338433,
                    "x": 105.28110590434758
                }, {"y": 27.30487572505893, "x": 105.28151011774743}, {
                    "y": 27.30491528887824,
                    "x": 105.28172771888791
                }, {"y": 27.304955173857778, "x": 105.28178539311043}, {
                    "y": 27.305035672970067,
                    "x": 105.2818111847724
                }, {"y": 27.305317406831662, "x": 105.28183582496821}],
                "type": "REGION"
            }
        }],
        "fieldCaptions": ["SmID", "SmUserID", "SmArea", "SmPerimeter", "ID", "mpArea", "mpPerimete", "村代码", "乡镇代码", "县代码", "是否贫困", "负责人", "联系电话", "自然村数", "镇名", "县名", "村名", "农民年均纯收入", "牲畜存栏数", "总户数", "总人口数", "贫困户数", "贫困人口数", "五保人数", "低保人数", "少数民族人数", "妇女人数", "残疾人数", "劳动力人数", "异地搬迁扶贫户数", "未实现饮水安全户数", "危房改造户数", "在校大学生数", "在校高中数", "vd_earth", "有效灌溉面积", "林地面积", "退耕还林面积", "村级集体经济收入", "OldID"],
        "fieldTypes": ["INT32", "INT32", "DOUBLE", "DOUBLE", "INT32", "DOUBLE", "DOUBLE", "TEXT", "TEXT", "TEXT", "INT16", "TEXT", "TEXT", "INT16", "TEXT", "TEXT", "TEXT", "INT32", "INT32", "INT32", "INT32", "INT32", "INT32", "INT32", "INT32", "INT32", "INT32", "INT32", "INT32", "INT32", "INT32", "INT32", "INT32", "INT32", "DOUBLE", "DOUBLE", "DOUBLE", "DOUBLE", "DOUBLE", "TEXT"],
        "fields": ["SmID", "SmUserID", "SmArea", "SmPerimeter", "ID", "mpArea", "mpPerimete", "vd_id", "Town_id", "country_id", "is_proper", "vd_head", "vd_contact", "vd_group_num_1", "Town_name", "County_name", "vd_name", "Vd_Average_Net_income", "vd_ainim_count", "vc_hh_num", "vc_total_people", "vc_poor_num", "vc_poor_people", "vc_five_people", "vc_lowinc_people", "vc_minority_num", "vc_women_num", "vc_disabled_num", "vc_labor_num", "vc_move_hhnum", "vc_nowater_hhnum", "vc_reconstru_hhnum", "vc_college_studnumber", "vc_senior_studnumber", "vd_earth", "vd_irri", "vd_forest", "vd_resore_earth", "Vd_income", "OldID"]
    }], "totalCount"
:
    1, "currentCount"
:
    1, "customResponse"
:
    null
}